locust-taurus/bzt_script/stress_test.yml
# JsonServer Stress Testing
execution:
  scenario: system_test
  concurrency: 1000
  ramp-up: 30s
  hold-for: 1m30s # time to hold target concurrency
  iterations: 10000 # limit scenario iterations number
  throughput: 500 # max RPS count generated
  steps: 4

scenarios:
  system_test:
    # default-address: http://${BASE_IP}:3000 # get variable from  "settings -> env"  block
    default-address: http://${__env(BASE_IP)}:3000 # set your IP address from Jmeter function
    # Use  __P(BASE_IP) , or __BeanShell(System.getenv("BASE_IP")) jmeter functions to get the variables
    timeout: 30  #  global scenario timeout for connecting, receiving results, 30 seconds by default
    think-time: 500ms  # global scenario delay between each request
    keepalive: true  # flag to use HTTP keep-alive for connections, default is true
    requests:
      - /users
      - /posts
      - /posts/1

reporting:
- module: console
- module: blazemeter
  report-name: JsonServer Stress Test
  test: Stress Test
  project: My Taurus Project

#settings:
#  env:
#    BASE_IP: localhost